Revit 2020 API
UnitUtils.IsValidUnitType Method
 Checks whether a unit type is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public static bool IsValidUnitType(
	UnitType unitType
)
Visual Basic
Public Shared Function IsValidUnitType ( _
	unitType As UnitType _
) As Boolean
Visual C++
public:
static bool IsValidUnitType(
	UnitType unitType
)
Parameters
unitType
Type: Autodesk.Revit.DB.UnitType
 The unit type to check.
Return Value
 True if the unit type is valid, false otherwise.
Remarks
 A unit type is considered valid if it is an actual unit type like UT_Length or UT_Angle. Obsolete values and the special values UT_Custom and UT_Undefined are not considered valid.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace